package beta;

public class howtoplay {


	public static void hp1() {
		System.out.println("1. 테마 선택\r\n"
				+ "원하는 테마를 선택합니다.\r\n"
				+ "테마별로 난이도가 다르며, 난이도가 높을 수록 얻을 수 있는 포인트도 많아집니다.\r\n"
				+ "\r\n"
				+ "2. 게임 진행\r\n"
				+ "2-1) 포인트 배팅\r\n"
				+ "문제 출력 전  포인트를 배팅합니다.\r\n"
				+ "\r\n"
				+ "플레이어에게는 기본 포인트 100,000p가 주어지며 해당 포인트를 가지고 게임을 플레이 할 수 있습니다.\r\n"
				+ "\r\n"
				+ "배팅할 수 있는 포인트는 아래와 같습니다.\r\n"
				+ "등급 - 포인트\r\n"
				+ "등급 - 포인트\r\n"
				+ "등급 - 포인트\r\n"
				+ "\r\n"
				+ "2-2) 문제 맞추기\r\n"
				+ "문제는 한글 초성과 함께 빈칸 개수가 주어집니다.\r\n"
				+ "한글 초성으로 어떤 단어인지 생각해보고 빈칸 개수에 맞춰 알파벳으로 정답을 입력합니다.\r\n"
				+ "\r\n"
				+ "문제 풀이 속도와 남은 기회에 따라 얻을 수 있는 보상이 다릅니다.\r\n"
				+ "풀이 기회를 소진하거나 문제 풀이 이후 종료를 선택하면 게임이 종료됩니다.\r\n"
				+ "\r\n"
				+ "\r\n"
				+ "2-3) 총 결과 출력\r\n"
				+ "게임에서 획득한 총 포인트와 함께 결과가 출력됩니다.\r\n");
	}
	

	public static void hp2() {
		System.out.println("2. 랭킹\r\n"
				+ "포인트를 많이 보유하고 있는 상위 5위 플레이어의 아이디와 닉네임, 보유포인트가 표시됩니다.\r\n"
				+ "포인트를 쌓아 랭킹을 노려보세요!\r\n");
	}
	
	
	public static void hp3() {
		System.out.println("3. 상점\r\n"
				+ "포인트로 일반 뽑기와 펫 뽑기를 진행할 수 있습니다\r\n"
				+ "\r\n"
				+ "- 일반뽑기\r\n"
				+ "뽑기 1회 당 10,000p가 소모됩니다.\r\n"
				+ "포인트 보호티켓, 포인트 배율 증가티켓, 펫 뽑기 티켓, 10만 포인트, 그리고... 꽝! 을 뽑을 수 있습니다.\r\n"
				+ "\r\n"
				+ "- 펫 뽑기\r\n"
				+ "반뽑기에서 얻은 펫 뽑기 티켓을 통해 펫 뽑기를 진행할 수 있습니다.\r\n"
				+ "총 5종의 펫을 뽑아 함께 게임을 진행해보세요!\r\n");
	}
	
	
	public static void hp4() {
		System.out.println("4. 가위바위보\r\n"
				+ "가위바위보 게임에서 이기면 가위바위보 티켓을 얻을 수 있습니다.\r\n"
				+ "게임 룰은 일반적인 가위바위보와 같습니다.\r\n"
				+ "\r\n"
				+ "가위바위보 티켓은 가위바위보 상점에서 사용할 수 있습니다.\r\n"
				+ "\r\n"
				+ "가위바위보 상점에서는 5만 포인트, 배팅포인트 보호티켓, 배율추가티켓, 그리고. . . 꽝! 을 뽑을 수 있습니다.\r\n");
	}
		

}
